ConfigurationFonecmidDiplomTuzeka/src/InformationRegisters/ВКМ_КалендарьРабочихДней/ВКМ_КалендарьРабочихДней.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_КалендарьРабочихДней</name>
  <resources>
    <name>ВКМ_Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ConfigurationFonecmidDiplomTuzeka/src/CommonModules/ВКМ_ПроизводственныйКалендарь/Module.bsl
#Область ПрограммныйИнтерфейс

// Вычисляет количество рабочих дней (с понедельника по пятницу) в указанном периоде.
//
// Параметры:
//  ДатаНачала - Дата - начало периода.
//  ДатаОкончания - Дата - конец периода.
//
// Возвращаемое значение:
//  Число - количество рабочих дней.
Функция ВКМ_КоличествоРабочихДней(ДатаНачала, ДатаОкончания) Экспорт

	Если ДатаНачала > ДатаОкончания Тогда
		Возврат 0;
	КонецЕсли;

	РабочихДнейВНеделе = 5;
	СекундВСутках = 86400;

	Количество = 0;
	ТекущаяДата = НачалоДня(ДатаНачала);
	ПоследнийДень = НачалоДня(ДатаОкончания);

	Пока ТекущаяДата <= ПоследнийДень Цикл
		Если ДеньНедели(ТекущаяДата) <= РабочихДнейВНеделе Тогда
			Количество = Количество + 1;
		КонецЕсли;
		ТекущаяДата = ТекущаяДата + СекундВСутках;
	КонецЦикла;

	Возврат Количество;

КонецФункции

// Вычисляет количество календарных дней в указанном периоде включительно.
//
// Параметры:
//  ДатаНачала - Дата - начало периода.
//  ДатаОкончания - Дата - конец периода.
//
// Возвращаемое значение:
//  Число - количество календарных дней.
Функция ВКМ_КоличествоКалендарныхДней(ДатаНачала, ДатаОкончания) Экспорт

	Если ДатаНачала > ДатаОкончания Тогда
		Возврат 0;
	КонецЕсли;

	СекундВСутках = 86400;

	Возврат Цел((НачалоДня(ДатаОкончания) - НачалоДня(ДатаНачала)) / СекундВСутках) + 1;

КонецФункции

// Вычисляет сумму коэффициентов графика работы за указанный период включительно.
//
// Параметры:
//  НачалоПериода - Дата - начало периода.
//  КонецПериода - Дата - конец периода.
//
// Возвращаемое значение:
//  Число - сумма коэффициентов графика за период, 0 - если в графике нет записей за этот период.
Функция ВКМ_СуммаКоэффициентовГрафика(НачалоПериода, КонецПериода) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(КалендарьРабочихДней.ВКМ_Коэффициент), 0) КАК Сумма
	|ИЗ
	|	РегистрСведений.ВКМ_КалендарьРабочихДней КАК КалендарьРабочихДней
	|ГДЕ
	|	КалендарьРабочихДней.ВКМ_Дата МЕЖДУ &НачалоПериода И &КонецПериода";
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));

	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();

	Возврат Выборка.Сумма;

КонецФункции

// Дополняет график работы недостающими днями указанного периода: с понедельника по пятницу
// ставится коэффициент 1, в остальные дни - 0. Уже заполненные дни не изменяются.
//
// Параметры:
//  НачалоПериода - Дата - начало периода.
//  КонецПериода - Дата - конец периода.
Процедура ВКМ_ЗаполнитьГрафикРаботы(НачалоПериода, КонецПериода) Экспорт

	РабочихДнейВНеделе = 5;
	СекундВСутках = 86400;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КалендарьРабочихДней.ВКМ_Дата КАК Дата
	|ИЗ
	|	РегистрСведений.ВКМ_КалендарьРабочихДней КАК КалендарьРабочихДней
	|ГДЕ
	|	КалендарьРабочихДней.ВКМ_Дата МЕЖДУ &НачалоПериода И &КонецПериода";
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));

	ЗаполненныеДни = Новый Соответствие;

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполненныеДни.Вставить(Выборка.Дата, Истина);
	КонецЦикла;

	НаборЗаписей = РегистрыСведений.ВКМ_КалендарьРабочихДней.СоздатьНаборЗаписей();

	ТекущаяДата = НачалоДня(НачалоПериода);
	ПоследнийДень = НачалоДня(КонецПериода);
	Пока ТекущаяДата <= ПоследнийДень Цикл

		Если ЗаполненныеДни.Получить(ТекущаяДата) = Неопределено Тогда
			Запись = НаборЗаписей.Добавить();
			Запись.ВКМ_Дата = ТекущаяДата;
			Запись.ВКМ_Коэффициент = ?(ДеньНедели(ТекущаяДата) <= РабочихДнейВНеделе, 1, 0);
		КонецЕсли;

		ТекущаяДата = ТекущаяДата + СекундВСутках;

	КонецЦикла;

	Если НаборЗаписей.Количество() > 0 Тогда
		НаборЗаписей.Записать(Ложь);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
